#include <stdio.h>

int main(void)
{
	int a = 20, b = 3;
	double res;

	res = ((double)a) / ((double)b);								//(double)를 통해 a와 b의 값을 일시적으로 실수로 변환
	printf("a=%d, b=%d\n", a, b);
	printf("a/b의 결과: %.1lf\n", res);

	a = (int)res;													//(int)를 이용해 일시적으로 res의 값에서 정수 부분만 추림
	printf("(int)%.1lf의 결과: %d\n", res, a);

	
/*---------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*sizeof() 연산자*/

	int w = 10;
	double e = 3.4;

	printf("int형 변수의 크기: %d\n", sizeof(w));
	printf("double형 변수의 크기 %d\n", sizeof(e));
	printf("정수형 상수의 크기: %d\n", sizeof(10));
	printf("수식의 결괏값의 크기: %d\n", sizeof(1.5 + 3.4));
	printf("char 자료형의 크기: %d\n", sizeof(char));

/*---------------------------------------------------------------------------------------------------------------------------------------------------------------*/
//복합대입 연산자

	int r = 10, t = 20;
	int qwe = 2;

	r += 20;
	qwe *= t + 10;

	printf("r=%d, t=%d\n", r, t);
	printf("qwe=%d\n", qwe);

/*---------------------------------------------------------------------------------------------------------------------------------------------------------------*/
// 콤마 연산자

	int y = 10, u = 20;
	int wer;

	wer(++y, ++u);			//차례로 연산이 수행되며 결과적으로 wer에 저장되는 값은 증가된 u의 값이다.

	printf("y:%d, u:%d\n", y, u);
	printf("wer%d\n", wer);

/*---------------------------------------------------------------------------------------------------------------------------------------------------------------*/
//조건 연산자

	int i = 10, o = 20, ert;

	ert = (i > o) ? i : o;
	printf("큰 값: %d\n", ert);



	return 0;
}